jendotpg/slippi-beamer/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

# PSRAM is off on purpose - it can cause extreme WiFi slowdown on the ESP32-S3
CONFIG_SPIRAM=n
CONFIG_ESP_MAIN_TASK_AFFINITY_CPU0=y
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_CODEPAGE_437=y

CONFIG_ESP_CONSOLE_UART_CUSTOM=y
CONFIG_ESP_CONSOLE_UART_TX_GPIO=43
CONFIG_ESP_CONSOLE_UART_RX_GPIO=44

# On crash sends a core dump to flash and halts. Together with the `coredump` 
# partition, this helps debugging: components/beamer_msc/beamer_panic.c reads
# the summary  in phase PrepareForBind of the next boot and it lands in
# CONFIG/error.txt.
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF=y
CONFIG_ESP_COREDUMP_CHECKSUM_CRC32=y
CONFIG_ESP_COREDUMP_MAX_TASKS_NUM=16
CONFIG_ESP_SYSTEM_PANIC_PRINT_HALT=y

CONFIG_LOG_COLORS=n
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

CONFIG_WL_SECTOR_SIZE_512=y

CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_TX_BA_WIN=16

CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024

CONFIG_LWIP_TCP_SND_BUF_DEFAULT=8640
CONFIG_LWIP_TCP_MAXRTX=3
CONFIG_LWIP_MAX_ACTIVE_TCP=2
CONFIG_LWIP_TCP_MSL=5000
CONFIG_LWIP_TCP_MSS=1440
CONFIG_LWIP_TCP_QUEUE_OOSEQ=n
CONFIG_LWIP_MAX_UDP_PCBS=6
CONFIG_LWIP_MAX_RAW_PCBS=4
CONFIG_LWIP_MAX_LISTENING_TCP=4
CONFIG_LWIP_IPV6=n

CONFIG_MDNS_TASK_PRIORITY=6
CONFIG_MDNS_TASK_AFFINITY_CPU0=n
CONFIG_MDNS_TASK_AFFINITY_NO_AFFINITY=y
